Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 7, 179, 12)        120       
                                                                 
 max_pooling2d (MaxPooling2D  (None, 7, 89, 12)        0         
 )                                                               
                                                                 
 conv2d_1 (Conv2D)           (None, 7, 89, 24)         888       
                                                                 
 conv2d_2 (Conv2D)           (None, 7, 89, 32)         2336      
                                                                 
 max_pooling2d_1 (MaxPooling  (None, 7, 44, 32)        0         
 2D)                                                             
                                                                 
 conv2d_3 (Conv2D)           (None, 7, 44, 64)         6208      
                                                                 
 conv2d_4 (Conv2D)           (None, 7, 44, 128)        24704     
                                                                 
 max_pooling2d_2 (MaxPooling  (None, 7, 22, 128)       0         
 2D)                                                             
                                                                 
 conv2d_5 (Conv2D)           (None, 7, 20, 256)        98560     
                                                                 
 flatten (Flatten)           (None, 35840)             0         
                                                                 
 dense (Dense)               (None, 128)               4587648   
                                                                 
 dense_1 (Dense)             (None, 32)                4128      
                                                                 
 dense_2 (Dense)             (None, 1)                 33        
                                                                 
=================================================================
Total params: 4,724,625
Trainable params: 4,724,625
Non-trainable params: 0
_________________________________________________________________
